[
  {
    "year": "2024",
    "title": "Vehicle Maintenance Analytics",
    "subtitle": "Analyzing fuel consumption, oil usage, and service patterns",
    "description": "Built a user-friendly tool that empowers vehicle owners to make informed maintenance decisions based on detailed analysis of fuel consumption, oil usage, and service patterns."
  },
  {
    "year": "2024",
    "title": "Petty Cash Management App",
    "subtitle": "Streamlined financial tracking for small businesses",
    "description": "Developed a streamlined petty cash reporting application that enhances financial tracking and accountability for small businesses, providing an efficient and user-friendly solution."
  },
  {
    "year": "2023",
    "title": "Re-design the UI and Website of Keemasan",
    "subtitle": "Enhancing user experience for Keemasan ID",
    "description": "Revitalized the Keemasan website with a modern, user-friendly redesign that enhances the user experience, ensuring a seamless and engaging online presence for PT Kebun Emas Nusantara."
  },
  {
    "year": "2022",
    "title": "Manage and Develop Payportal for Duithape",
    "subtitle": "Optimizing payment processes for better user experience",
    "description": "Developed and managed Duithape's payportal solution, optimizing payment processes to provide a streamlined and efficient experience for users, increasing overall satisfaction."
  },
  {
    "year": "2022",
    "title": "Developing Boxity from Zero to Something",
    "subtitle": "A comprehensive web-based ERP application",
    "description": "Launched Boxity, a web-based ERP application designed to streamline business operations. From core features like issue tracking to advanced modules including stock management and financial reporting, Boxity aims to empower businesses with increased efficiency and productivity."
  },
  {
    "year": "2021",
    "title": "Water Chemical Management App for the Australian Government",
    "subtitle": "Ensuring safety and sustainability in water resources",
    "description": "Developed a powerful water chemical management app for the Australian Government in collaboration with CRC Care and Digital Envision Pty Ltd. The app is designed to ensure safety and sustainability in water resources management."
  },
  {
    "year": "2021",
    "title": "Internal Solution and Website Redesign for BTSA",
    "subtitle": "Enhancing operations with user-centric solutions",
    "description": "Optimized BTSA operations with an enhanced internal app and a redesigned website, focusing on user-centric solutions for greater efficiency and improved performance."
  }
]